#include "patches.h"
#include "misc_funcs.h"
#include "PR/os_pi.h"

int dummy = 1;
int dummyBSS;

extern s32 D_8001C3F8;
extern OSIoMesg D_8001C400;
extern OSMesgQueue D_8001C418;

extern void osYieldThread(void);

extern void func_800007F0(s32 id, void* vAddr);

extern Gfx D_8029F718[];
extern Gfx D_8029F6D8[];
extern Gfx D_200000[];

extern u8 *D_802A5390;
extern u32 D_802A5388;

extern s32 D_80100000;
extern u8 D_8014C8D0[];
extern s32 D_8029F5E0;
extern s32 D_8029F5F8;
extern s32 D_802A5368;
extern Gfx* gMasterDisplayList; // D_802A5390


extern u8 D_8029F810[];
extern u8 D_8029F7F8[];

struct UnkStruct800BD5B0 D_800BD770;

struct UnkStruct800BD5B0 {
    Vp unk_00;
    u32 unk10;
    u32 unk14;
    Mtx unk_18;
    u32 unk58;
    f32 unk5C;
    f32 unk60;
    f32 unk64;
    f32 unk68;
};

struct UnkStruct802A538C {
    char pad[0x40];  
};

extern struct UnkStruct800BD5B0 D_800BD5B0[];
extern Mtx* D_802A538C;
extern Mtx D_802A53D8;

extern u16 D_802A53D0;

typedef struct {
  unsigned char	col[3];		/* diffuse light value (rgba) */
  char 		pad1;
  unsigned char	colc[3];	/* copy of diffuse light value (rgba) */
  char 		pad2;
  signed char	dir[3];		/* direction of light (normalized) */
  char 		pad3;
} NewLight_t;

typedef struct {
  unsigned char	col[3];		/* ambient light value (rgba) */
  char 		pad1;
  unsigned char	colc[3];	/* copy of ambient light value (rgba) */
  char 		pad2;
} NewAmbient_t;

typedef union {
    NewLight_t	l;
} NewLight;

typedef union {
    NewAmbient_t	l;
} NewAmbient;

typedef struct {
    NewAmbient	a;
    NewLight	l[2];
} NewLights2;

// hack, due to long width issues
extern NewLights2 D_8029F800 __attribute__((aligned(8)));

void *Libc_Memcpy(void *dest, void *source, s32 c);

extern void *func_80227678(u32);
void func_80297D60(void *, s32);

typedef unsigned int uintptr_t;

struct UnkStruct802AC5C0 {
    u16 unk0;
    u16 unk2;
    u16 unk4;
    u16 unk6;
    u16 unk8;
    u16 unkA;
    u16 unkC;
    u16 unkE;
    char pad10[0x4C];
    f32 unk5C;
    f32 unk60;
    f32 unk64;
    f32 unk68;
};

extern s32 D_802A53BC;
extern s32 D_802A53C0;
extern s32 D_802A53C4;
extern s32 D_802A53C8;

s32 HuPrcCreate(s32*, s32, s32, s32, s32);                  /* extern */
s32 func_802276FC(s32);                                 /* extern */
void *func_8022A6C4(void *, s32);                        /* extern */
struct UnkStruct802B0308_Inner *func_8026CE28(s32);                        /* extern */
extern s32 D_802A1B50;

typedef struct {
    int Unk00;     // Offset: 0x00
    int UnkFlags1;     // Offset: 0x04
    int FileID;     // Offset: 0x08
    int UnkFlags2;     // Offset: 0x0C
    int UnkFlags3;     // Offset: 0x10
    int UnkFlags4;     // Offset: 0x14
    float ScrollXSpeed;     // Offset: 0x18
    float ScrollYSpeed;     // Offset: 0x1C
    float ScrollX;     // Offset: 0x20
    float ScrollY;     // Offset: 0x24
    float OffsetX;     // Offset: 0x28
    float OffsetY;     // Offset: 0x2C
    float ResX;     // Offset: 0x30
    float ResY;     // Offset: 0x34
    float ShiftX;     // Offset: 0x38
    float ShiftY;     // Offset: 0x3C
    float ScaleX;     // Offset: 0x40
    float ScaleY;     // Offset: 0x44
    float ImageWidth;     // Offset: 0x48
    float ImageHeight;     // Offset: 0x4C
} SkyBox;

extern SkyBox D_802B0260;

struct UnkStruct802B0300_Inner {
    char pad[0x10];
    u16 unk10;
    u16 unk12;
};

struct UnkStruct802B0300 {
    struct UnkStruct802B0300_Inner *unk0;
};

struct UnkStruct802B0308_Inner {
    char pad[0xC];
    u32 unkC;
    f32 unk10;
    f32 unk14;
    f32 unk18;
    f32 unk1C;
    f32 unk20;
    f32 unk24;
};

struct UnkStruct802B0308 {
    struct UnkStruct802B0308_Inner *unk0;
};

extern struct UnkStruct802B0300 D_802B0300[];
extern struct UnkStruct802B0308 D_802B0308[];

extern void func_80287904();

RECOMP_EXPORT void recomp_enable_rects_extended(Gfx **gfx) {
    recomp_printf("(E) Master Display List: 0x%08X\n", gMasterDisplayList);
    gEXSetRectAspect((*gfx++), G_EX_ASPECT_STRETCH);
}

RECOMP_EXPORT void recomp_disable_rects_extended(Gfx **gfx) {
    recomp_printf("(D) Master Display List: 0x%08X\n", gMasterDisplayList);
    gEXSetRectAspect((*gfx++), G_EX_ASPECT_AUTO);
}

// init_skybox
